// Модуль 1. Заняття 1. Змінні, типи та оператори.

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 1 - Математичні оператори
// Виведи на екран загальну кількість яблук та винограду. Різницю яблук та винограду.

// const apples = 47
// const grapes = 135

// const total = apples + grapes // 47 + 135

// console.log('total', total)

// const diff = apples - grapes

// console.log('diff', diff)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 2 - Комбіновані оператори
// Заміни вираз перевизначення комбінованим оператором +=.

// let students = 100
// students = students + 1
// students+=1
// students++
// students--

// console.log(students)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 3 - Пріоритет операторів
// Розбери пріоритет операторів в інструкції привласнення значення змінної result.

// const result = 108 + 223 - 2 * 5
// console.log(result)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 4 - Клас Math
// Напиши скрипт, який виводить у консоль заокруглені вгору/вниз і т.д. значення змінної value.
// Використовуй методи Math.floor(), Math.ceil() та Math.round(). Перевір що буде в консолі при значеннях 27.3 та 27.9.

// const value = 27.999999999999
// console.log('Math.floor(27.999999999999) :>> ', Math.floor(value))
// console.log(' Math.ceil(27.999999999999) :>> ', Math.ceil(value))
// console.log(' Math.round(27.999999999999) :>> ', Math.round(value))

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 5 - Шаблонні рядки​⁡
// Склади фразу за допомогою шаблонних рядків A has B bots in stock, де A, B - змінні вставлені в рядок.

// const companyName = 'Cyberdyne Systems'
// const repairBots = 150
// const defenseBots = 50

// // const total = repairBots + defenseBots

// const message = `${companyName} has ${repairBots + defenseBots} bots in stock`

// console.log(message) // "Cyberdyne Systems has 200 bots in stock"

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 6 - Методи рядків та чейнінг​⁡
// Напиши скрипт, який розраховує індекс маси тіла людини. Для цього необхідно розділити
// вагу в кілограмах на квадрат висоти людини у метрах.

// Вага та висота зберігаються у змінних weight та height, але не як числа,
// а в вигляді рядків (спеціально для завдання).
// Не цілі числа можуть бути задані у вигляді 24.7 або 24,7, тобто як роздільник дробової частини може бути кома.

// Індекс маси тіла необхідно округлити до однієї цифри після коми;

// let weight = '24,7'
// let height = '1.75'

// let weight = prompt('Pls input your weight:')
// let height = prompt('Pls input your height:')

// const intWeight = Number.parseInt(weight)

// const startIndex = weight.indexOf(',')

// const floatWeight = weight.slice(startIndex + 1)

// weight = weight.replace(',', '.')

// // weight = Number(intWeight + '.' + floatWeight)

// const index = weight / Math.pow(height, 2)

// console.log('index :>> ', typeof index.toFixed(1))

// const index = (
// 	weight.replace(',', '.') / Math.pow(height.replace(',', '.'), 2)
// ).toFixed(1)

// console.log('index :>> ', index)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 7 - Оператори порівняння та приведення типів
// Яким буде результат виразів?

// console.log(5 > 4)

// console.log(10 >= '7x') // '10' >= '7x'

// console.log('112' > '12')

// console.log('2' < '12')

// console.log('4' == 4)

// console.log('6' === 6)

// console.log('false' === false)

// console.log(Number(undefined))

// console.log(1 == true)

// console.log(1 === true)

// console.log('0' == false) //>>Number>> 0 == 0

// console.log('0' === false)

// console.log('Papaya' < 'papaya')
// console.log('p', 'p'.charCodeAt())
// console.log('P', 'P'.charCodeAt())

// console.log('Papaya' === 'papaya')

// console.log(undefined == false)

// console.log(undefined == null)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 8 - Логічні оператори
// Яким буде результат виразів?

// console.log(true && 3)

// console.log(false && 3)

// console.log(true && 4 && 'kiwi')

// console.log(true && false && 'kiwi')

// console.log(false || 0 || null)

// console.log(true || 3 || 4)

// console.log(0 || false || 7)

// console.log(null || 2 || undefined)

// console.log((1 && null && 2) > 0)

// console.log(null || (2 && 3) || 4)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 9 - Значення за замовчуванням та оператор нульового злиття​⁡
// Отрефактори код так, щоб у змінну value присвоювалося значення змінної incomingValue,
// якщо воно не рівне undefined або null. В іншому випадку має присвоюватися значення defaultValue.
// Перевір роботу скрипта для наступних значень змінної incomingValue: null, undefined, 0, false.
// Використовуй оператор ?? (nullish coalescing operator).

// const incomingValue = 0
// const defaultValue = 10

// // 0 || null || 10

// const value = incomingValue ?? defaultValue
// console.log(value)

// _______________________________________________________________________________________________________________________________________
// _______________________________________________________________________________________________________________________________________

// Example 10 - Оператор % та методи рядків
// Напиши скрипт, який переведе значення totalMinutes (кількість хвилин) в рядок у форматі годин та хвилин HH:MM.

// 70 покаже 01:10
// 450 покаже 07:30
// 1441 покаже 24:01
// const totalMinutes = 70
