//⁡⁢⁣⁢ ⁡⁢⁢⁢​‌‌‍Модуль 𝟮. Заняття 𝟯. Масиви⁡⁡​​⁡

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟭 - Базові операції з масивом​⁡

// Створіть масив genres з елементами «Jazz» та «Blues».
// Додайте «Рок-н-рол» до кінця.
// Виведіть у консоль перший елемент масиву.
// Виведіть у консоль останній елемент масиву.
// Код повинен працювати для масиву довільної довжини.
// Видаліть перший елемент та виведіть його в консоль.
// Вставте «Country» та «Reggae» на початок масиву.

// const genres = ['Jazz', 'Blues']
// genres.push('Рок-н-рол')

// console.log('genres[0] :>> ', genres[0], genres[genres.length - 1])
// console.log('genres[genres.length-1] :>> ', genres[genres.length - 1])

// // const delEl = genres.shift()
// const delEl = genres.splice(0, 1)

// genres.unshift('Country', 'Reggae')

// console.log('delEl :>> ', delEl)
// console.log('genres', genres)

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟮 - Масиви та рядки​⁡

// Напиши скрипт для обчислення площі прямокутника зі сторонами,
// значення яких зберігаються у змінній values у вигляді рядка.
// Значення гарантовано розділені пробілом.

// const values = '8 11'
// const arr = values.split(' ')
// console.log('arr :>> ', arr)

// const result = Number(arr[0]) * Number(arr[1])

// console.log('result :>> ', result)

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟯 - Перебір масиву​⁡

// Напиши скрипт для перебору масиву fruits циклом for.
// Для кожного елемента масиву виведи в консоль рядок у форматі
// номер_елемента: значення_елемента.
// Нумерація елементів повинна починатися з 1.

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋']

// for (let i = 0; i < fruits.length; i++) {
// 	const index = i + 1
// 	console.log(index, ':', fruits[i])
// }

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟰 - Масиви та цикли​⁡

// Напиши скрипт, який виводить у консоль ім'я та телефонний номер користувача.
// У змінних names та phones зберігаються рядки імен та телефонних номерів, розділені комами.
// Порядковий номер імен та телефонів у рядках вказують на відповідність.
// Кількість імен та телефонів гарантовано однакова.

// const names = 'Jacob,William,Solomon,Artemis'
// const phones = '89001234567,89001112233,890055566377,890055566300'

// const namesArr = names.split(',')
// const phonesArr = phones.split(',')

// for (let i = 0; i < namesArr.length; i++) {
// 	console.log(namesArr[i], ':', phonesArr[i])
// }

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟱 - Масиви та рядки​⁡

// Напиши скрипт, який виводить у консоль усі слова рядка крім першого і останнього.
// Результуючий рядок не повинен починатися або закінчуватися символ пробілу.
// Скрипт повинен працювати для будь-якого рядка.

// const string = 'Welcome to the future'

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟲 - Масиви та рядки​⁡

// Напиши скрипт, який «розгортає» рядок (зворотній порядок букв) і виводить його в консоль.

// const string = 'Welcome to the future'

// const reverse = string.split(' ').reverse().join(' ')

// console.log('reverse :>> ', reverse)
// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ⁡⁢⁣⁣​‌‍‌𝗘𝘅𝗮𝗺𝗽𝗹𝗲 𝟳 - Пошук елемента​⁡

// Напиши скрипт пошуку найменшого числа у масиві. Код повинен працювати для будь-якого
// масиву чисел.
// Використовуй цикл для розв'язання задачі.

// const numbers = [2, 17, 94, 1, 23, 37]

// ⁡⁢⁢⁢_______________________________________________________________________________________________________________________________________⁡

// ​‌‍‌⁡⁢⁣⁣‍‍Example 8 - Магазин​​⁡

// Відправити суму проданих товарів кожного постачальника
// Всі товари по 20
// Закупівля по 10

// const startOrderPrice = 10

// const productFromFirst = [
// 	'тарілка',
// 	'ложка',
// 	'виделка',
// 	'стільчик',
// 	'стол',
// 	'ніж',
// 	'банка',
// 	'лопатка',
// ]
// const codeFromFirst = [
// 	'1234',
// 	'2345',
// 	'3456',
// 	'4567',
// 	'5678',
// 	'6789',
// 	'7890',
// 	'8901',
// ]

// const productFromSecond = [
// 	'рушник',
// 	'халат',
// 	'подушка',
// 	'простирадло',
// 	'лампа',
// 	'ліхтарик',
// 	'іграшка',
// 	'лялька',
// ]
// const codeFromSecond = [
// 	'12341',
// 	'23451',
// 	'34561',
// 	'45671',
// 	'56781',
// 	'67891',
// 	'78901',
// 	'89011',
// ]

// const cashRegister = [
// 	'45671',
// 	'56781',
// 	'67891',
// 	'6789',
// 	'7890',
// 	'8901',
// 	'78901',
// 	'89011',
// ]
