// Модуль 1. Заняття 2. Розгалуження. Цикли
// __________________________________________________________________________________________________________________________

// Example 1 - Введення користувача та розгалуження

// Використовуючи конструкцію if..else та prompt, напиши код, який питатиме: "Яка офіційна назва JavaScript?". Якщо користувач вводить ECMAScript, то показуй alert з рядком "Правильно!", в іншому випадку - "Не знаєте? ECMAScript!"

// const message = prompt('Яка офіційна назва JavaScript?').toLowerCase()

// const currentAnswer = 'ECMAScript'

// if (message === currentAnswer.toLowerCase()) {
// 	alert('Правильно!')
// } else {
// 	alert(`Не знаєте? ${currentAnswer}!`)
// }

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 2 - Відображення часу (if...else)

// Напиши скрипт для відображення годин та хвилин у консолі браузера у вигляді рядка формату "14 г. 26 хв.". Якщо значення змінної minutes дорівнює 0, то виводь рядок "14 г.", без хвилин.

// function getRandomArbitrary(min, max) {
// 	return Number.parseInt(Math.random() * (max - min) + min)
// }

// const hours = getRandomArbitrary(0, 24)
// const minutes = getRandomArbitrary(0, 59)
// let timeString

// // if (minutes === 0) {
// // 	timeString = `${hours} г.`
// // } else {
// // 	timeString = `${hours} г. ${minutes} хв.`
// // }

// // minutes === 0
// // 	? (timeString = `${hours} г.`)
// // 	: (timeString = `${hours} г. ${minutes} хв.`)

// timeString = minutes === 0 ? `${hours} г.` : `${hours} г. ${minutes} хв.`

// console.log(timeString)

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 3 - Розгалуження

// Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо у prompt користувач ввів число більше нуля. Якщо було введено нуль, виводь в консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі повинен бути рядок "Це негативне число".

// const userInput = prompt('Введіть число')

// let message

// if (userInput !== '' && userInput !== null) {
// 	if (userInput > 0) {
// 		message = 'Це позитивне число'
// 	} else if (Number(userInput) === 0) {
// 		message = 'Це нуль'
// 	} else {
// 		message = 'Це негативне число'
// 	}
// } else {
// 	message = 'Введіть дані'
// }

// console.log('message :>> ', message)

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 4 - Вкладені розгалуження

// Напиши скрипт, який порівнює числа у змінних a та b. Якщо обидва значення більше 100, то виведи в консоль максимальне з них. В протилежному випадку у консолі повинна бути сума значення b та числа 512.

// const a = 180
// const b = -180

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 5 - Форматування посилання (endsWith)

// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /. Якщо ні, додай до кінця значення link цей символ. Використовуй конструкцію if...else.

// let link = 'https://my-site.com/about/'

// // const lastSymbol = link[link.length - 1]

// // if (lastSymbol !== '/') {
// // 	link = link + '/'
// // }

// // link = lastSymbol !== '/' ? link + '/' : link

// if (!link.endsWith('/')) {
// 	link = link + '/'
// }

// console.log('link', link)

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 6 - Форматування посилання (includes та логічне «І»)

// Напиши скрипт який перевіряє чи закінчується значення змінної link символом /. Якщо ні, додай до кінця значення link цей символ, але тільки в тому випадку, якщо в link є підрядок "my-site". Використовуй конструкцію if...else.

// let link = 'https://my-site.com/about'

// console.log(link)

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 7 - Форматування посилання (тернарний оператор)

// Виконай рефакторинг коду задачі номер 4, використовуючи тернарний оператор.

// let link = 'https://somesite.com/about'
// if (link.includes('my-site') && !link.endsWith('/')) {
// 	link += '/'
// }
// console.log(link)

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 8 - if...else та логічні оператори

// Напиши скрипт який виводитиме в консоль браузера рядок залежно від значення змінної hours.
// Якщо значення змінної hours:
// -- менше 17, виводь рядок "Pending"
// -- більше або дорівнює 17 і менше або дорівнює 24, виводь рядок "Expires"
// -- більше 24 , виводь рядок "Overdue"

// const hours = 10;

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 9 - Дедлайн здачі проекту (if...else)
// Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй конструкцію if...else.

// Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
// Якщо до дедлайну 1 день - виведи рядок "Завтра"
// Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
// Якщо до дедлайну 3+ днів - виведи рядок "Дата у майбутньому"

// const daysUntilDeadline = 5;
// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 10 - Дедлайн здачі проекту (switch)

// Виконай рефакторинг коду задачі номер 9 використовуючи switch.

// const daysUntilDeadline = 5

// if (daysUntilDeadline === 0) {
// 	console.log('Сьогодні')
// } else if (daysUntilDeadline === 1) {
// 	console.log('Завтра')
// } else if (daysUntilDeadline === 2) {
// 	console.log('Післязавтра')
// } else {
// 	console.log('Дата у майбутньому')
// }

// switch (daysUntilDeadline) {
// 	case 0:
// 		console.log('Сьогодні')
// 		break
// 	case 1:
// 		console.log('Завтра')
// 		break
// 	case 2:
// 		console.log('Післязавтра')
// 		break
// 	default:
// 		console.log('Дата у майбутньому')
// 		break
// }

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 11 - Цикл for

// Напиши цикл for, який виводить у консоль браузера числа за зростанням від min до max, але тільки якщо число кратне 5.

// const max = 106
// const min = 3

// for (let i = min; i <= max; i += 1) {
// 	if (i % 2 === 0) {
// 		console.log('i :>> ', i)
// 	}
// }

// __________________________________________________________________________________________________________________________
// __________________________________________________________________________________________________________________________

// Example 12 - Введення користувача та розгалуження

// Напиши скрипт, який питатиме логін за допомогою prompt та логувати результат у консоль браузера.

// Якщо відвідувач вводить "Адмін", то prompt запитує пароль
// Якщо нічого не введено або натиснуто клавішу Esc - вивести рядок "Скасовано"
// В іншому випадку вивести рядок "Я вас не знаю"
// Пароль перевіряти так:

// Якщо введено пароль "Я адмін", то вивести рядок "Здрастуйте!"
// Інакше виводити рядок "Невірний пароль"

// for (let i = 0; i < 10; i += 3) {
// 	console.log('i :>> ', i)
// }
